  13:33:58: здарова
  13:34:39: слушай, я тут разочаровался с фат фс ченовской
  13:34:51: может ты конечно поправишь
  13:35:18: смотри, при чтении файла нужно указывать буфер, куда читать
  13:35:47: дык вот, неужели буфер надо делать только 512 байт ??
  13:36:26: мне вот к примеру надо было делать по 20 байт читать из файла - пиздец как все сложно
  13:36:37: и потом
  13:37:47: допустим файл нужно читать не в цикле как всегда а когда нужно, к примеру несколько байт считал - другие дела, несколько байт еще, потом ...и тд. так это я так понял вообще невозможно